---
type: IViewSheetSet
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# IViewSheetSet

`Autodesk.Revit.DB.IViewSheetSet` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsAutomatic | — | `bool IsAutomatic { get ; set ; }` |
| Property | OrderedViewList | — | `IReadOnlyList < View > OrderedViewList { get ; set ; }` |
| Property | SheetOrganizationId | — | `ElementId SheetOrganizationId { get ; set ; }` |
| Property | ViewOrganizationId | — | `ElementId ViewOrganizationId { get ; set ; }` |
| Property | Views | — | `ViewSet Views { get ; set ; }` |